note/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-16 Fri 09:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
<link rel="icon" type="image/png" href="../favicon.png">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../home/index.html"> UP </a>
 |
 <a accesskey="H" href="../home/index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5ef73f0">1. Blog in Org Mode, Revisited</a></li>
<li><a href="#orgb2035b6">2. Easy Bindings when Region Is Active</a></li>
<li><a href="#orge27c2a5">3. Emacs Keymap Precedence</a></li>
<li><a href="#orgbd94285">4. Ivy to Helm</a></li>
<li><a href="#org08e2ba7">5. My Favorite Musicians</a></li>
<li><a href="#orgbace36c">6. Who Called My Function?</a></li>
<li><a href="#org9edbda8">7. Emacs Gateway Drug</a></li>
<li><a href="#org85de20d">8. Org Mode in Source File</a></li>
<li><a href="#org473131c">9. Retro Terminal Blog Style</a></li>
<li><a href="#orgeacea29">10. Join Chat on IRC</a></li>
<li><a href="#org74374bc">11. Wanderlust</a></li>
<li><a href="#org81b15fe">12. My Favorite Animes</a></li>
<li><a href="#orga2b8533">13. Use Indirect Buffers</a></li>
<li><a href="#orgf74c16c">14. Basic Sorting Algorithm</a></li>
<li><a href="#org27bfe6c">15. Cool URI Does not Change</a></li>
<li><a href="#orge8d04fb">16. Blog with only Org Mode</a></li>
<li><a href="#org676e372">17. Note About Domain and DNS</a></li>
<li><a href="#org2969a9b">18. Fancy startup screen for emacs</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5ef73f0" class="outline-2">
<h2 id="org5ef73f0"><span class="section-number-2">1</span> <a href="./2018/blog-in-org-mode-revisited/index.html">Blog in Org Mode, Revisited</a></h2>
<div class="outline-text-2" id="text-1">
<p>
How to build a blog with Org Mode and without any framework.
</p>
</div>
</div>

<div id="outline-container-orgb2035b6" class="outline-2">
<h2 id="orgb2035b6"><span class="section-number-2">2</span> <a href="./2018/easy-bindings-when-region-is-active/index.html">Easy Bindings when Region Is Active</a></h2>
<div class="outline-text-2" id="text-2">
<p>
Bind a set of easy bindings when region is active.
</p>
</div>
</div>

<div id="outline-container-orge27c2a5" class="outline-2">
<h2 id="orge27c2a5"><span class="section-number-2">3</span> <a href="./2018/emacs-keymap-precedence/index.html">Emacs Keymap Precedence</a></h2>
<div class="outline-text-2" id="text-3">
<p>
Which keymap overrides which in Emacs.
</p>
</div>
</div>

<div id="outline-container-orgbd94285" class="outline-2">
<h2 id="orgbd94285"><span class="section-number-2">4</span> <a href="./2018/ivy-to-helm/index.html">Ivy to Helm</a></h2>
<div class="outline-text-2" id="text-4">
<p>
How and why I switched from ivy to Helm.
</p>
</div>
</div>

<div id="outline-container-org08e2ba7" class="outline-2">
<h2 id="org08e2ba7"><span class="section-number-2">5</span> <a href="./2018/my-favorite-musicians/index.html">My Favorite Musicians</a></h2>
<div class="outline-text-2" id="text-5">
<p>
A list of my favorite musicians.
</p>
</div>
</div>

<div id="outline-container-orgbace36c" class="outline-2">
<h2 id="orgbace36c"><span class="section-number-2">6</span> <a href="./2018/who-called-my-function/index.html">Who Called My Function?</a></h2>
<div class="outline-text-2" id="text-6">
<p>
Check who called the innocent function in Emacs. Useful to find the culprit in start up process.
</p>
</div>
</div>

<div id="outline-container-org9edbda8" class="outline-2">
<h2 id="org9edbda8"><span class="section-number-2">7</span> <a href="./2018/emacs-gateway-drug/index.html">Emacs Gateway Drug</a></h2>
<div class="outline-text-2" id="text-7">
<p>
Tricks that can lure your friend into using Emacs.
</p>
</div>
</div>

<div id="outline-container-org85de20d" class="outline-2">
<h2 id="org85de20d"><span class="section-number-2">8</span> <a href="./2018/org-mode-in-source-file/index.html">Org Mode in Source File</a></h2>
<div class="outline-text-2" id="text-8">
<p>
Create header and fold/unfold entries in any source file.
</p>
</div>
</div>

<div id="outline-container-org473131c" class="outline-2">
<h2 id="org473131c"><span class="section-number-2">9</span> <a href="./2018/retro-terminal-blog-style/index.html">Retro Terminal Blog Style</a></h2>
<div class="outline-text-2" id="text-9">
<p>
I made my home page looks like a secret SCP style retro terminal archive.
</p>
</div>
</div>

<div id="outline-container-orgeacea29" class="outline-2">
<h2 id="orgeacea29"><span class="section-number-2">10</span> <a href="./2018/join-chat-on-irc/index.html">Join Chat on IRC</a></h2>
<div class="outline-text-2" id="text-10">
<p>
How use this cool protocol to chat with hackers.
</p>
</div>
</div>

<div id="outline-container-org74374bc" class="outline-2">
<h2 id="org74374bc"><span class="section-number-2">11</span> <a href="./2018/wanderlust/index.html">Wanderlust</a></h2>
<div class="outline-text-2" id="text-11">
<p>
Some notes I took when trying to setup Wanderlust.
</p>
</div>
</div>

<div id="outline-container-org81b15fe" class="outline-2">
<h2 id="org81b15fe"><span class="section-number-2">12</span> <a href="./2018/my-favorite-animes/index.html">My Favorite Animes</a></h2>
<div class="outline-text-2" id="text-12">
<p>
A list of animes that I love.
</p>
</div>
</div>

<div id="outline-container-orga2b8533" class="outline-2">
<h2 id="orga2b8533"><span class="section-number-2">13</span> <a href="./2018/use-indirect-buffers/index.html">Use Indirect Buffers</a></h2>
<div class="outline-text-2" id="text-13">
<p>
A cool hidden feature of Emacs.
</p>
</div>
</div>

<div id="outline-container-orgf74c16c" class="outline-2">
<h2 id="orgf74c16c"><span class="section-number-2">14</span> <a href="./2018/basic-sorting-algorithm/index.html">Basic Sorting Algorithm</a></h2>
<div class="outline-text-2" id="text-14">
<p>
Study note about basic sorting algorithms.
</p>
</div>
</div>

<div id="outline-container-org27bfe6c" class="outline-2">
<h2 id="org27bfe6c"><span class="section-number-2">15</span> <a href="./2018/cool-uri-does-not-change/index.html">Cool URI Does not Change</a></h2>
<div class="outline-text-2" id="text-15">
<p>
An article I read and agree with.
</p>
</div>
</div>

<div id="outline-container-orge8d04fb" class="outline-2">
<h2 id="orge8d04fb"><span class="section-number-2">16</span> <a href="./2018/blog-with-only-org-mode/index.html">Blog with only Org Mode</a></h2>
<div class="outline-text-2" id="text-16">
<p>
How to build blog site with only Org Mode (and HTML, CSS and JavaScript).
</p>
</div>
</div>

<div id="outline-container-org676e372" class="outline-2">
<h2 id="org676e372"><span class="section-number-2">17</span> <a href="./2018/note-about-domain-and-dns/index.html">Note About Domain and DNS</a></h2>
<div class="outline-text-2" id="text-17">
<p>
Some notes I take when trying to add a custom domain to GitHub Pages.
</p>
</div>
</div>

<div id="outline-container-org2969a9b" class="outline-2">
<h2 id="org2969a9b"><span class="section-number-2">18</span> <a href="./2018/fancy-startup-screen-for-emacs/index.html">Fancy startup screen for emacs</a></h2>
<div class="outline-text-2" id="text-18">
<p>
Display something fancier on startup.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yuan Fu</p>
<p class="date">Created: 2018-11-16 Fri 09:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
